# ## 题目一：个人BMI健康指数计算器
#
# **【需求描述】** BMI（身体质量指数）是国际常用的衡量人体胖瘦程度的标准。请编写程序，通过键盘录入用户的**姓名**、**身高（单位：米，如1.75）**、**体重（单位：千克，如70.0）**。 程序需要计算该用户的BMI指数（计算公式：`BMI = 体重 / (身高 * 身高)`），并按照指定格式输出结果，**BMI指数需保留两位小数**。
#
# **【输入/输出示例】**
#
# > **请输入您的姓名：** 张三 **请输入您的身高(米)：** 1.75 **请输入您的体重(千克)：** 70
# >
# >
# >
# > **输出结果：** 张三 您好，您的BMI指数为：22.86，请继续保持健康！

name = input('请输入您的姓名')
height = float(input('请输入您的身高（米）'))
weight = float(input('请输入您的体重（千克）'))

Bmi = weight / (height * height)
print(f"{name}，您的BMI指数是：{Bmi:.2f}")


