## 题目二：学生期末成绩统计系统

# **【需求描述】** 期末考试结束后，班主任需要统计学生的成绩。请编写程序，通过键盘录入**学生姓名**，以及**语文**、**数学**、**英语**三门课程的成绩（成绩可能包含小数，如89.5）。 程序需要计算该学生的**总分**和**平均分**，并按照指定格式打印成绩单，**平均分需保留一位小数**。
#
# **【输入/输出示例】**
#
# > **请输入学生姓名：** 李四
# >
# > **请输入语文成绩：** 90
# >
# > **请输入数学成绩：** 85.5
# >
# > **请输入英语成绩：** 92
# >
# >
# >
# > **输出结果：-------- 成绩单 -------- 学生姓名：李四 总成绩：267.5 分 平均成绩：89.2 分**


name = input("请输入学生姓名")
chinese = float(input("请输入语文成绩"))
math = float(input("请输入数学成绩"))
english = float(input("请输入英语成绩"))

total_score = chinese + math + english
avg_score = total_score/3
print("-------- 成绩单 --------")
print(f"学生姓名:{name} 总成绩:{total_score:.1f} 平均成绩:{avg_score:.1f}")

